//============================================================================
// 
// アチーブ [achievement.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "achievement.h"
#include "utility.h"

// シーン取得用
#include "manager.h"

// デバッグ表示用
#include "renderer.h"

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CAchieve::CAchieve() :
	CObject_X{ static_cast<int>(LAYER::FRONT_MIDDLE) }	// 基底クラスのコンストラクタ
{

}

//============================================================================
// プライオリティ指定コンストラクタ
//============================================================================
CAchieve::CAchieve(LAYER priority) :
	CObject_X{ static_cast<int>(priority) }	// 基底クラスのコンストラクタ
{

}

//============================================================================
// デストラクタ
//============================================================================
CAchieve::~CAchieve()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CAchieve::Init()
{
	// 基底クラスの初期設定
	HRESULT hr = CObject_X::Init();

	return hr;
}

//============================================================================
// 終了処理
//============================================================================
void CAchieve::Uninit()
{
	// 基底クラスの終了処理
	CObject_X::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CAchieve::Update()
{
	// 回転
	D3DXVECTOR3 rotTarget =  GetRot();
	rotTarget.y += 0.05f;
	SetRot(rotTarget);

	// 基底クラスの更新
	CObject_X::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CAchieve::Draw()
{
	// 基底クラスの描画処理
	CObject_X::Draw();
}

//============================================================================
// 生成
//============================================================================
CAchieve* CAchieve::Create(D3DXVECTOR3 pos)
{
	// インスタンスを生成
	CAchieve* pAchieve = DBG_NEW CAchieve{};

	if (pAchieve == nullptr)
	{ // 生成失敗
		assert(false);
	}

	// タイプを設定
	pAchieve->SetType(TYPE::ACHIEVE);

	// 基底クラスの初期設定
	pAchieve->Init();

	// 位置の設定
	pAchieve->SetPos(pos);

	// モデルを取得
	auto model = CModel_X_Manager::GetInstance()->GetModel(CModel_X_Manager::TYPE::ACHIEVE);

	// モデルを設定
	pAchieve->BindModel(model);

	// サイズを設定
	pAchieve->SetSize(model->size);

	// 描画される前に一度更新しておく
	pAchieve->Update();

	return pAchieve;
}