//============================================================================
// 
// 弾 [bullet.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "bullet.h"

// テクスチャ取得用
#include "texture_manager.h"

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CBullet::CBullet() :
	CObject_billboard{ static_cast<int>(LAYER::BACK_MIDDLE) }
{

}

//============================================================================
// デストラクタ
//============================================================================
CBullet::~CBullet()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CBullet::Init()
{
	// 基底クラスの初期設定
	HRESULT hr = CObject_billboard::Init();

	return hr;
}

//============================================================================
// 終了処理
//============================================================================
void CBullet::Uninit()
{
	// 基底クラスの終了処理
	CObject_billboard::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CBullet::Update()
{
	// 基底クラスの更新
	CObject_billboard::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CBullet::Draw()
{
	// 基底クラスの描画処理
	CObject_billboard::Draw();
}

//============================================================================
// 生成
//============================================================================
CBullet* CBullet::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// インスタンスを生成
	CBullet* pBullet = DBG_NEW CBullet;

	if (pBullet == nullptr)
	{ // 生成失敗
		assert(false);
	}

	pBullet->SetType(TYPE::NONE);	// タイプを設定

	pBullet->Init();			// 基底クラスの初期設定
	pBullet->SetPos(pos);	// 位置の設定
	pBullet->SetSize(size);	// サイズの設定

	pBullet->SetTexWidth(1.0f / 8.0f);	// 横テクスチャ分割幅
	pBullet->SetTexHeight(1.0f);			// 縦テクスチャ分縦幅

	// テクスチャを設定
	pBullet->BindTex(CTexture_Manager::GetInstance()->GetTexture(CTexture_Manager::TYPE::BULLET_00));

	return pBullet;
}