////============================================================================
//// 
//// フェード遷移処理、ヘッダファイル [fade.h]
//// Author : 福田歩希
//// 
////============================================================================
//
//#ifndef _FADE_H_
//#define _FADE_H_	// 二重インクルード防止
//
////****************************************************
//// フェードクラス
////****************************************************
//class CFade
//{
//public:
//
//	CFade();	// コンストラクタ
//	~CFade();	// デストラクタ
//
//	HRESULT Init();	// 初期設定
//	void Uninit();	// 終了処理
//	void Enter();	// フェードイン
//	void Exit();	// フェードアウト
//	void Draw();	// 描画処理
//
//private:
//
//	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;	// 頂点バッファのポインタ
//
//	float m_fBrightness;	// 明度
//};
//
//#endif // _FADE_H_