////============================================================================
//// 
//// 煙エフェクト、ヘッダファイル [smoke.h]
//// Author : 福田歩希
//// 
////============================================================================
//
////****************************************************
//// インクルードファイル
////****************************************************
//#include "Object_3D.h"
//
////****************************************************
//// 煙エフェクトクラス
////****************************************************
//class CSmoke : public CObject_3D
//{
//public:
//
//	CSmoke();	// コンストラクタ
//	~CSmoke();	// デストラクタ
//
//	HRESULT Init() override;	// 初期設定
//	void Uninit() override;		// 終了処理
//	void Update() override;		// 更新処理
//	void Draw() override;		// 描画処理
//
//	static CSmoke* Create();	// 生成
//
//private:
//
//	int m_nDuration;	// 寿命
//};