//============================================================================
// 
// 背景 [bg.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "bg.h"
#include "manager.h"

//============================================================================
// コンストラクタ
//============================================================================
CBg::CBg() : CObject2D(LAYER::BACK)
{
	m_nCntPAKU = 0;		// パクパク回数
	m_nDelayPAKU = 0;	// パクパク遅延
}

//============================================================================
// デストラクタ
//============================================================================
CBg::~CBg()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CBg::Init()
{
	// 基底クラスの初期設定
	HRESULT hr = CObject2D::Init();

	return hr;
}

//============================================================================
// 終了処理
//============================================================================
void CBg::Uninit()
{
	// 基底クラスの終了処理
	CObject2D::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CBg::Update()
{
	// パクパクします
	PAKUPAKU();

	// 基底クラスの更新
	CObject2D::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CBg::Draw()
{
	// 基底クラスの描画処理
	CObject2D::Draw();
}

//============================================================================
// 生成
//============================================================================
CBg* CBg::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	CBg* pBg = new CBg;

	// 生成出来ていたら初期設定
	if (pBg != nullptr)
	{
		pBg->SetType(TYPE::NONE);	// タイプを設定

		pBg->Init();		// 基底クラスの初期設定
		pBg->SetPos(pos);	// 中心位置の設定
		pBg->SetSize(size);	// サイズの設定
	}

	// テクスチャを取得
	LPDIRECT3DTEXTURE9 pTex = CManager::GetRenderer()->GetTextureInstane()->GetTexture(CTexture::TEX_TYPE::BG_000);

	// テクスチャを設定
	pBg->BindTex(pTex);

	return pBg;
}

//============================================================================
// パクパクします
//============================================================================
void CBg::PAKUPAKU()
{
	m_nDelayPAKU++;

	if (m_nCntPAKU <= 0)
	{
		if (m_nDelayPAKU >= 140)
		{
			BindTex(CManager::GetRenderer()->GetTextureInstane()->GetTexture(CTexture::TEX_TYPE::BG_000));

			m_nCntPAKU++;

			m_nDelayPAKU = 0;
		}
		if (m_nDelayPAKU >= 120)
		{
			BindTex(CManager::GetRenderer()->GetTextureInstane()->GetTexture(CTexture::TEX_TYPE::BG_001));
		}
	}
	else
	{
		if (m_nDelayPAKU >= 40)
		{
			BindTex(CManager::GetRenderer()->GetTextureInstane()->GetTexture(CTexture::TEX_TYPE::BG_000));

			m_nCntPAKU++;

			m_nDelayPAKU = 0;

			if (m_nCntPAKU >= 4)
			{
				m_nCntPAKU = 0;
			}
		}
		if (m_nDelayPAKU >= 20)
		{
			BindTex(CManager::CManager::GetRenderer()->GetTextureInstane()->GetTexture(CTexture::TEX_TYPE::BG_001));
		}
	}
}