//============================================================================
// 
// 弾 [bullet.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "bullet.h"
#include "main.h"
#include "manager.h"
#include "explosion.h"

//============================================================================
// コンストラクタ
//============================================================================
CBullet::CBullet() : CObject2D::CObject2D()
{
	m_nRemain = 0;		// 使用期間
	m_fFlyAngle = 0;	// 飛ぶ角度
}

//============================================================================
// デストラクタ
//============================================================================
CBullet::~CBullet()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CBullet::Init()
{
	// 基底クラスの初期設定
	HRESULT hr = CObject2D::Init();

	return hr;
}

//============================================================================
// 終了処理
//============================================================================
void CBullet::Uninit()
{
	// 基底クラスの終了処理
	CObject2D::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CBullet::Update()
{
	// 移動
	Translation();

	// 期間経過
	Progress();

	// 基底クラスの更新
	CObject2D::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CBullet::Draw()
{
	// 基底クラスの描画処理
	CObject2D::Draw();
}

//============================================================================
// 生成
//============================================================================
CBullet* CBullet::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, int nRemain, float fFlyAngle)
{
	CBullet* pBullet = new CBullet;

	// 生成出来ていたら初期設定
	if (pBullet != nullptr)
	{
		pBullet->Init();					// 基底クラスの初期設定
		pBullet->SetPos(pos);				// 中心位置の設定
		pBullet->SetSize(size);				// サイズの設定
		pBullet->m_nRemain = nRemain;		// 使用期間の設定
		pBullet->m_fFlyAngle = fFlyAngle;	// 飛ぶ角度の設定
	}

	// デバイスを取得
	LPDIRECT3DDEVICE9 pDev = CManager::GetRenderer()->GetDeviece();

	// テクスチャのポインタ
	LPDIRECT3DTEXTURE9 pTex = nullptr;

	// テクスチャの生成
	D3DXCreateTextureFromFile(pDev,
		"data\\TEXTURE\\bullet000.png",
		&pTex);

	// テクスチャを設定
	pBullet->BindTex(pTex);

	return pBullet;
}

//============================================================================
// 移動
//============================================================================
void CBullet::Translation()
{
	// 中心位置情報を取得
	D3DXVECTOR3 pos = CObject2D::GetPos();

	// 設定された角度に飛んでいく
	pos.x += sinf(m_fFlyAngle) * 10.0f;
	pos.y += cosf(m_fFlyAngle) * 10.0f;

	// 中心位置を設定
	CObject2D::SetPos(pos);
}

//============================================================================
// 期間経過
//============================================================================
void CBullet::Progress()
{
	// 使用期間カウントダウン
	m_nRemain--;

	// 使用期間がなくなると消滅
	if (m_nRemain <= 0)
	{
		// 自身を破棄
		CObject::Release();

		// 爆発を生成
		//CExplosion::Create(
		//	m_pos,						// 中心位置
		//	{ 50.0f, 50.0f, 0.0f });	// サイズ
	}
}