//============================================================================
// 
// テクスチャ管理 [texture.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "texture.h"
#include "manager.h"

//****************************************************
// 静的メンバの初期化
//****************************************************
LPDIRECT3DTEXTURE9 CTexture::m_apTexTemp[MAX_TEX];	// テクスチャ管理

//============================================================================
// コンストラクタ
//============================================================================
CTexture::CTexture()
{
	for (int i = 0; i < MAX_TEX; i++)
	{
		m_apTexTemp[i] = nullptr;	// テクスチャ情報の初期化
	}
}

//============================================================================
// デストラクタ
//============================================================================
CTexture::~CTexture()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CTexture::Load()
{
	// デバイスを取得
	LPDIRECT3DDEVICE9 pDev = CManager::GetRenderer()->GetDeviece();

	for (int i = 0; i < TEX_TYPE::MAX; i++)
	{
		// テクスチャの生成
		D3DXCreateTextureFromFile(pDev,
			m_aFilename[i],
			&m_apTexTemp[i]);

		if (m_apTexTemp[i] == nullptr)
		{ // テクスチャ生成失敗
			assert(false);
		}
	}

	return S_OK;
}

//============================================================================
// 終了処理
//============================================================================
void CTexture::Unload()
{
	for (int i = 0; i < TEX_TYPE::MAX; i++)
	{
		// テクスチャの破棄
		if (m_apTexTemp[i] != nullptr)
		{
			m_apTexTemp[i]->Release();
			m_apTexTemp[i] = nullptr;
		}
	}
}

//============================================================================
// テクスチャを取得
//============================================================================
LPDIRECT3DTEXTURE9 CTexture::GetTex(TEX_TYPE type)
{
	if (m_apTexTemp[type] == nullptr)
	{ // テクスチャ取得不能
		assert(false);
	}

	return m_apTexTemp[type];
}